In [16]:
import pandas as pd
import numpy as np

In [37]:
df = pd.read_csv('Python_Linear_Regres-2.csv')

In [38]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [41]:
df.head()
df['region'].unique()
df1 = df
df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [69]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
df1['sex'] = encoder.fit_transform(df1['sex'])
# female = 0
#male = 1
df1['region'] = encoder.fit_transform(df1['region'])
# southwest = 3
# southeast = 2
# northwest = 1
# northeast = 0
df1['smoker'] = encoder.fit_transform(df1['smoker'])
# yes = 1
# no = 0
df1.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

In [75]:
import math
df1['charges'] = df['charges'].apply(np.floor)
df1.head()

   age  sex     bmi  children  smoker  region  charges
0   19    0  27.900         0       1       3  16884.0
1   18    1  33.770         1       0       2   1725.0
2   28    1  33.000         3       0       2   4449.0
3   33    1  22.705         0       0       1  21984.0
4   32    1  28.880         0       0       1   3866.0

In [76]:
X = df1.drop('charges',axis=1)
y = df1['charges']

In [77]:
X.head()

   age  sex     bmi  children  smoker  region
0   19    0  27.900         0       1       3
1   18    1  33.770         1       0       2
2   28    1  33.000         3       0       2
3   33    1  22.705         0       0       1
4   32    1  28.880         0       0       1

In [78]:
X['sex'].head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [79]:
y.head()

0    16884.0
1     1725.0
2     4449.0
3    21984.0
4     3866.0
Name: charges, dtype: float64

In [10]:
from sklearn.model_selection import train_test_split

In [80]:
X_train , X_test , y_train , y_test = train_test_split(X,y,test_size=0.2)

In [22]:
from sklearn.linear_model import LinearRegression

In [81]:
ln = LinearRegression()

In [82]:
ln.fit(X_train,y_train)

LinearRegression()

In [83]:
ln.score(X_test,y_test)

0.6902490870270284

In [84]:
X_test.head()

      age  sex     bmi  children  smoker  region
1076   47    0  32.000         1       0       3
608    28    1  26.980         2       0       0
23     34    0  31.920         1       1       0
187    30    0  30.900         3       0       3
897    19    1  25.555         1       0       1

In [85]:
y_test.head()

1076     8551.0
608      4435.0
23      37701.0
187      5325.0
897      2221.0
Name: charges, dtype: float64

In [87]:
ln.predict([[47,0,32.00,1,0,3]])

array([10476.60726948])